app/views/subforums/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."subforum_id" = ?  [["subforum_id", 2]]
---
<h2>Posts</h2>
<% @subforum.posts.each do |post| %>