app/controllers/posts_controller.rb

SELECT  "subforums".* FROM "subforums" WHERE "subforums"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("title", "body", "subforum_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hi"], ["body", "hello"], ["subforum_id", 1], ["created_at", "2018-04-04 19:45:29.511080"], ["updated_at", "2018-04-04 19:45:29.511080"]]
---
  def create
    @subforum = Subforum.find(params[:subforum_id])
    @post = @subforum.posts.new(post_params)

    if @post.save