app/controllers/subforums_controller.rb

  def index
    @subforums=Subforum.all
---
SELECT "subforums".* FROM "subforums"

  def show
    @subforum = Subforum.find(params[:id])
---
SELECT  "subforums".* FROM "subforums" WHERE "subforums"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @subforum = Subforum.new(params.require(:subforum).permit(:title))
    @subforum.save
---
INSERT INTO "subforums" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "testing params"], ["created_at", "2018-04-02 21:14:18.090616"], ["updated_at", "2018-04-02 21:14:18.090616"]]