app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    @user.save
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "elizabeth"], ["password", "Testing again"], ["created_at", "2018-03-26 02:09:37.565138"], ["updated_at", "2018-03-26 02:09:37.565138"]]