app/controllers/welcome_controller.rb

SELECT "subforums".* FROM "subforums"
---
  def index
    @subforums = Subforum.all